/*
 * Put the content of this file in your main bundle strings file to localize SwiftParsec.
 */

/* Expression parser. */
"ambiguous use of a %@ associative operator" = "ambiguous use of a %@ associative operator";

/* Token parser, character literal. */
"character" = "character";

/* Error messages. */
"column" = "column";

/* Primitive parsers. */
"Combinator 'many' is applied to a parser that accepts an empty string." = "Combinator 'many' is applied to a parser that accepts an empty string.";

/* Character parsers. */
"crlf new-line" = "crlf new-line";

/* JSON language definition. */
"decoding error" = "decoding error";

/* Character parsers. */
"digit" = "digit";

/* Token parser, end of reserved name.
   Token parser, end of reserved operator. */
"end of " = "end of ";

/* Token parser. */
"end of character" = "end of character";

/* Token parser. */
"end of comment" = "end of comment";

/* Parser combinators. */
"end of input" = "end of input";

/* Token parser. */
"end of string" = "end of string";

/* Token parser. */
"end of string gap" = "end of string gap";

/* JSON language definition.
   Swift language definition.
   Token parser, character escape. */
"escape code" = "escape code";

/* Swift language definition. */
"escape sequence" = "escape sequence";

/* Error messages. */
"expecting" = "expecting";

/* Token parser, double number. */
"exponent" = "exponent";

/* Token parser. */
"float" = "float";

/* Token parser, double number. */
"fraction" = "fraction";

/* Character parsers. */
"hexadecimal digit" = "hexadecimal digit";

/* Swift language definition. */
"hexadecimal digit(s)" = "hexadecimal digit(s)";

/* Token parser. */
"identifier" = "identifier";

/* Token parser. */
"Int overflow" = "Int overflow";

/* Token parser. */
"integer" = "integer";

/* Left-associative parser. */
"left" = "left";

/* Character parsers. */
"letter" = "letter";

/* Character parsers. */
"letter or digit" = "letter or digit";

/* Character parsers. */
"lf new-line" = "lf new-line";

/* Error messages. */
"line" = "line";

/* Token parser. */
"literal character" = "literal character";

/* Token parser. */
"literal string" = "literal string";

/* Character parsers. */
"lowercase letter" = "lowercase letter";

/* Token parser, natural number. */
"natural" = "natural";

/* Character parsers. */
"new-line" = "new-line";

/* Non-associative parser. */
"non" = "non";

/* Token parser. */
"number" = "number";

/* Character parsers. */
"octal digit" = "octal digit";

/* Expression parser label.
   Token parser. */
"operator" = "operator";

/* Error messages. */
"or" = "or";

/* Primitive parsers. */
"parse error at " = "parse error at ";

/* Token parser label. */
"reserved operator " = "reserved operator ";

/* Token parser. */
"reserved word " = "reserved word ";

/* Right-associative parser. */
"right" = "right";

/* Character parsers. */
"space" = "space";

/* JSON language definition. */
"surrogate pair" = "surrogate pair";

/* Character parsers. */
"symbol" = "symbol";

/* Character parsers. */
"tab" = "tab";

/* Error messages. */
"unexpected" = "unexpected";

/* Error messages. */
"unexpected end of input" = "unexpected end of input";

/* Character parsers. */
"unicode space" = "unicode space";

/* Error messages. */
"unknown parse error" = "unknown parse error";

/* Character parsers. */
"uppercase letter" = "uppercase letter";

/* Token parser. */
"value outside of Unicode codespace" = "value outside of Unicode codespace";

/* Character parsers. */
"white space" = "white space";
